[{"text": " Guest Demo: Eric Iverson’s Itty Bitty Search\nFebruary 16th, 2010 by Daniel Tunkelang\nRespond\n\nI’m back from vacation, and still digging my way out of everything that’s piled up while I’ve been offline.\n\nWhile I catch up, I thought I’d share with you a demo that Eric Iverson was gracious enough to share with me. It uses Yahoo! BOSS to support an exploratory search experience on top of a general web search engine.\n\nWhen you perform a query, the application retrieves a set of related term candidates using Yahoo’s key terms API. It then scores each term by dividing its occurrence count within the result set by its global occurrence count–a relevance measure similar to one my former colleagues and I used at Endeca in enterprise contexts.\n\nYou can try out the demo yourself at http://www.ittybittysearch.com/. While it has rough edges, it produces nice results–especially considering the simplicity of the approach.\n\nHere’s an example of how I used the application to explore and learn something new. I started with [\"information retrieval\"]. I noticed “interactive information retrieval” as a top term, so I used it to refine. Most of the refinement suggestions looked familiar to me–but an unfamiliar name caught my attention: “Anton Leuski”. Following my curiosity, I refined again. Looking at the results, I immediately saw that Leuski had done work on evaluating document clustering for interactive information retrieval. Further exploration made it clear this is someone whose work I should get to know–check out his home page!\n\nI can’t promise that you’ll have as productive an experience as I did, but I encourage you to try Eric’s demo. It’s simple examples like these that remind me of the value of pursuing HCIR for the open web.\n\nSpeaking of which, HCIR 2010 is in the works. We’ll flesh out the details over the next weeks, and of course I’ll share them here.", "gender": "M"}, {"text": "Who moved my Cheese???   The world has been developing in and out in all the areas and to create a difference in this competitive world... we need to change...\nchange the way we take our things...\nbut we rather change or atleast try to change..... we try the same routine work evryday and expect to get more\nand when things fail such as losing a job, loss in business we would upset, discouraged, frustrated and keep on hanging to the same thing again and start complaining.\nCHANGE IS GOOD.... LETS WELCOME IT..!!!\nwondering wat is all about Cheese?? and what actually is all about \" Who Moved My Cheese??? \"\n\n\nWell...!!!! Who moved my cheese?? is a simple parable that reveals profound thoughts. It is an enlightening story of four characters who live in a maze and look for cheese to nourish them and make them happy. The story is about two mice called \"SNIFF\" and \"SCURRY\" and two little men ... smaller in size and who were similar to us people. Their names were \"HEM\" and \"HAW\"\n\nCheese is a metaphor for what you want to have in life - whether it is a good job, loving relationship, money or a possession, health or spiritual peace of mind.\n\nAnd the maze is where you look for what you want - the organisation you work in, or the family or community you live in.\n\nEveryday both the mice and men spent time in the maze looking for their own special cheese. The mice had only Rodent brains while the men used their brains, filled with many beliefs. The common thing between the rodents and these men is tat every morning they went in search for the cheese.\n\nThe maze had confusing network of paths corridors and some of the chambers had delicious cheese. But there were also dark corners and blind alleys leading nowhere. It was an easy place to get lost. Those who found the way to secret chambers had to enjoy a better life.\n\nAfter much of searching they found a chamber C which had an enormous amount of richest quality of Cheese.Rodents used the trial and error method by racing through the corridors. While the men used their brains and beliefs and experience.\n\nHAVING CHEESE MADE THEM HAPPY.\nBoth these men and rodents enjoyed the cheese everyday almost many many days and finally one day was such tat the cheese had to run out and there isnt left anymore.\nRodents observed the minute details of cheese getting decreased day by day and they were ready for the situation and were ready for the hunt of new Cheese.\nOn the otherhand these men based on their beliefs wondered \"Who moved their Cheese?\". Both HEM and HAW kept waiting for the cheese at the old place. Fearing that they might get lost in the maze they didnt start to find their way to new cheese and started starving and waiting in the old place. Both of them kept Hemming and Hawing for their old Cheese. But couldnt find any and increased frustration in them. It also created FEAR in them about what might happend if they get lost in finding new cheese..!!!\nThey started evaluating the situation at Chamber C and waited there everyday and returned homes hungry.\nTHEY WERE AFRAID OF CHANGE.\n\nMeanwhile,Rodents found out their new way and found a chamber N having more cheese than the older one.\n\nEverytime HAW wanted to go in search for the new Cheese. HEM would stop him. But one day in utter despair to find the new Cheese HAW started for his search leaving behind his friend HEM in the old chamber. He wrote on a wall so tat his friend had something to think about...\nIF YOU DONOT CHANGE, YOU CAN BECOME EXTINCT.\nand HAW in order to overcome his fear of getting lost in the maze ... he reminded himself as..\nWHAT WOULD YOU DO IF YOU WEREN'T AFRAID?\nhe continued his search and found a dark alley where he could smell some nice cheese\nhe was afraid of what might be on the other end... and started walking towards it.\nAND when he moved he felt free and rather more young than he is.\n\nWHEN YOU MOVE BEYOND YOUR FEAR, YOU FEEL FREE.!!!\nbut he didnt find any cheese it had some little pieces left over near the chamber, someone had already visited the chamber and completed it. He gulped some cheese leftover and kept some for his friend in his pocket and wondered if HEM was still in chamber C\n\nAll the while throughtout his search he kept on noticing the changes in him.. and everytime he is feeling happy and on the way back to his friend HEM , HAW had been thinking of himself as..\nwhy he hadnt moved out before to find the new cheese...??\nTHE QUICKER YOU LET GO , OF OLD CHEESE THE SOONER YOU FIND NEW CHEESE.\nIT IS SAFER TO SEARCH IN THE MAZE THAN REMAIN IN A CHEESELESS SITUATION.\nOLD BELIEFS DONOT LEAD YOU TO NEW CHEESE.\nHAW came back to his friend HEW and told his experience expecting him to turn out for searching. but HEW didnt.\nso he left him there and returned for his new treasure. before coming he told him about the way he felt and shared the cheese wid him.\nHAW started his journey back to the maze.\n\nWHEN YOU SEE THAT YOU CAN FIND AND ENJOY NEW CHEESE, YOU CHANGE COURSE.\nNOTICING SMALL CHANGES EARLY HELPS YOU ADAPT TO BIGGER CHANGES THAT ARE TO COME.\nfinally haw saw a bigger chamber wid all the variety of cheese wid enormous quantity and was happy to find the rodents der enjoying the cheese. but this time haw was ready for the change observing the minute changes so tat he could act fast.\n\nAs days passed one fine day he heard the footsteps and guessed it was HEW and was happy finally he started searching for the new cheese..!!!\n\n(HAW could have gone to HEW and say about the new cheese at the chamber N. but he didnt since one cannot infuse the seeds to overcome the fear and accept the change . it should be from inself)\n\nso evryone out der.... let us\nANTICIPATE CHANGE\nADAPT TO CHANGE QUICKLY\nENJOY THE CHANGE\nBE READY TO CHANGE QUICKLY,AGAIN AND AGAIN\n\nSo who you are ??? SCURRY SNIFFY HEM OR HAW ??\nAccepting changes like Scurry and Sniffy\nor else learning about the advantages of accepting changes\nor else hanging with the question... \" who moved my cheese??\"\n\nALL THE BEST.... :)", "gender": "M"}, {"text": " Yesterday I attended a biweekly meeting of an informal a UC Berkeley group devoted to Python in science (Py4Science), organized by Fernando Perez. The format (in honor of my visit) was a series of 4-minute lightning talks about various projects using Python in the scientific world (at Berkeley and elsewhere) followed by an hourlong Q&A session. This meant I didn't have to do a presentation and still got to interact with the audience for an hour -- my ideal format.\n\nI was blown away by the wide variety of Python use for scientific work. It looks like Python (with extensions like numpy) is becoming a standard tool for many sciences that need to process large amounts of data, from neuroimaging to astronomy.\n\nHere is a list of the topics presented (though not in the order presented). All these describing Python software; I've added names and affiliations insofar I managed to get them. (Thanks to Jarrod Millman for providing me with a complete list.) Most projects are easily found by Googling for them, so I have not included hyperlinks except in some cases where the slides emphasized them. (See also the blog comments.)", "gender": "M"}, {"text": " Liam is nothing like Natalie. Natalie never went through draws or cabinets. She was always so good. LIAM is a bit more adventurous. And he always picks the cabinets that are the hardest to put back together. Hubby just started Nutrisystem and he has his own little section of the kitchen. Well, Liam doesn't like the order of it all and trashes my set up at least 10 times a day. YES, I need to buy one of those locks for the doors. We have one for the chemicals. But none on the food. My mistake for SURE!\n\nIn the meantime, I better document it because before I know it this boy will be in college and I will be missing cleaning up after him.\nYeah.. that's not me. But I still decided that I wanted to start doing Yoga. I've been thinking about it for quite some time. So, this weekend I bought a pair of work out shorts and a tank and off I went. The only class that was close to me was Birkham Yoga, the hot one. The 100 degree sweaty room one.\n\nI. Almost. Died. \n\nThe Yoga itself was wonderful. I will continue that for sure. But the HEAT of that room was unbearable. The best part is, the teacher specifically came up to me and said,", "gender": "F"}, {"text": "In the EU we have browser choice, but few know about it  The EU has been tougher on monopolies than the American antitrust authorities. This has been good for Europe and bad for America. In Europe we have an amazing choice of fixed line internet providers for example. In the USA, there is generally one DSL provider and one Cable provider per territory. As a result, we have more bandwidth for less money. This is surprising because, in general, there is more choice at a better price for a lot of goods and services in the USA, including cars, banking and financial services, gadgets, etc. But the problem with the USA is that sometimes lobbying is more influential than the common good. In Europe, our career public servants seem to be less immune to lobbying (although not always, and banking, for example, seems to be an exception and most countries protect their local banks).  But recently, the EU has given us more choice in Europe. This time is the freedom to choose our browser. But as this survey shows most Europeans, around three quarters of them, are not aware of this choice. It turns out that Spain is the country with the lowest browser choice awareness in Europe.", "gender": "M"}, {"text": "Hmmm.. I really didn't wanna update my blog till my results were out. But Figured I might as well blog about something I've been wanting to for quite a while. But before i begin- heres wishin u a happy new year! I was waiting for a bus and Getting pretty restless, I started twirling my cellphone between my thumb and middle finger. I almost dropped my cellphone in shock as I heard a voice to my right yell, \"o*** dei! Cellphone vechirundha periya m***** nee?\"  Completely nonplussed, I turned around to see a pretty decently dressed chap on a bike looking straight at me with a furious look on his face. I didn't quite get it. The person standing in front of me seemed startled too. Guess he felt the guy was looking at him. That only confused me further. I couldn't quite make out who he was staring at! (Random note to self: Fury adds a squint to ur eye!!)\n  The-guy-in-front-of-me, let's jus call him X for my aching fingers' sake(!), was visibly offended. \"Excuse me?\" he said, his voice quavering lightly. He seemed guarded and didn't turn around to face the Biker dude (gotta make do with this name for the time being!) straight on. But nothing in the world could have prepared me for what followed next. My jaw almost hit the floor in bewilderment when the Biker dude retorted, \"Enna da English-la peela vudarae? English-la pesina nee periya p******-ya?\"  I could feel every eye in the bus stop trained on the three of us. What was happening? Why was he picking up a fight for no reason? And all of a sudden, a silly thought crossed my mind. Silly, but every inch possible. Was this some show like Candid Camera or MTV Bakra? Did I actually have a camera zooming in on me? Am I on TV?!? I absently ran my fingers through my hair. I was feeling extremely self-conscious! I just wanted to get the hell outta the place! (Random notes of enlightenment: My brain goes off into tangents in the opposite direction just when I want it to stay focussed.)  Perhaps Mr. X was too numb with shock to have such crazy ideas floating around in his head. he Biker dude wasn't done with the expletives. He mouthed yet another string of well-chosen obscenities. Even passers-by stopped to gawk at the scene. I really wanted to get outta that place!!  Mr.X had had enough. He spluttered in indignation, pulled himself up to full height and started to approach the Biker dude. Aaah, now this was gonna get interesting! :)  But things took yet another crazy twist as the manic look on the Biker dude's face flickered off. To be replaced by a slight hint of confusion. And then, full-blooded horror!  Mr. X seemed puzzled at the reaction too. Things fell into place when the Biker dude slapped his forehead and exclaimed \"phone-a vei da naaye. unaala en maaname pochu!\".  And even as he revved up his bike, and fled the scene, face red with embarassment, I caught a glimpse of the ear-piece of his Hands-free mobile set peep out from under his collar! :)", "gender": "F"}, {"text": "happy teachers day..!! who is celebrating..??\n\n\nI had already heard dis when i was still too young,\n\" good friends and good teachers are rare fortunes\"\n\n....teaching is of course the most noble profession.. and future of any nation lies in hands of it's teachers..!!\n\ntoday.. morning of 5th sept.. i m angry..!! don't know exactly why.. dere may be several reasons, like..\n.........in few hours i have to give my second monthly test,\n..........m totally stuck at 10th level of segreta!!\n............i have not slept the whole night,\n...............today is 5th sept..!!\nhappy teachers day.. !! am sorry to all my dear teachers who have taught me.. but i m not being able to show any excitement about this..\n\nmay be because i am angry.. or may be i am angry because of that only..!!!\nstill.. before i say anything else..\nthank you all my so good and so great teachers.. for what i am today is only a reflection of your thoughts, labour and love.. i miss u all..!!\n\n....now, i dont want to spoil my mood early morning by thinking about issues regarding this.. but i really feel very disappointed with the education system.. n teachers in our country..!!\nn i really dont need to say anything.. we already know.. how pathetic\nsituations are..\ni just want to draw our attention once again towards the \"architects of our county's future.. \" and call for a thought and contribution on your part.. coz if not we.. then no one!!\n\"seems.. today we want to do noble work only if we are not left with anything else.. \"\n\naah.. thinking about this really irritates me..!! cudn't stop to express dat..!! dere4 dis post..!!\n\np.s. segreta : iitb's treasure hunt", "gender": "M"}, {"text": "We watch movies. And we see what the camera intends to show us. Other things remaining stable, it is sometimes the camera that provides the movement. So is the case with the human eye. When I chose to isolate myself from the plethora of activities happening around, from the mundane action that surrounds me each day, there was a mild discovery I made. Ironically, irrespective of their mildness, these discoveries make me feel stronger every time they happen to me.  Getting back to the discovery I was talking about: I used my eyes as the video camera. I saw the panning, tilting, dollying and trollying movements as I strolled across my house. I noticed that the objects around me were stable only till my eyes cooperated, any non cooperation on their part brought about a movement in the world around me. And the secret that hit me was: stability is a state of the human eye, which responds to any stimulus provided by the ‘thoughting’ of the human brain.\n\n\nThen, must I always complain about the changing surroundings! The environment, thoughts, people, situations: they are often a part of the thoughts that stimulate my mind.", "gender": "F"}, {"text": "Cooking!  May be the title of the blog is a give away - I love cooking. Even though I am not very frequently doing so I love the act of conjuring mouth watering, aromatic delicacies :)\nI love chopping onions and chillies with the precision of millimeters (only if you have the right knife and technique) and the adventure of flash frying. I have spent a good part of my telly watching years savouring exotic dishes being made 'too simple to believe' from all over the world. \n\nAll that and more for my love of cooking later. \n\nWhat made me write this post was the fact whenever I am struggling with high pressure studies my mind tend to wander away to recipes for those after assignment parties (fictional of course!).\n\nI am in midst of writing a very crucial piece of my dissertation and thinking about shahi toasts (deep fried bread dipped in fragrant sugar syrup) and sewaiya (vermicilli in sweet milk) :) Some day I will post if I get to make any of these..for now I should go back to the dissertation. \n\nPS: I do cook occasional special dishes, strangely never thought of blogging about it. May be I can post some pics soon :)", "gender": "F"}, {"text": "The jhhhhaaakkkaaaasss DSN...Do It Now !!!  We all have personal barriers, old habits, or inhibitions that hold us back and keep us from fully participating in life. DSN Course is a rigorous and transformational course, designed by Sri Sri Ravi Shankar. Dropping whatever does not serve your best interests is a completely liberating experience—it makes you so strong that nothing in this world can shake you.  When you are ready for true liberation, true freedom and personal empowerment, then you are ready for the power of DSN!\n\nLast week I did DSN course for the second time and believe me,it was a life transforming experience. The dynamic,energetic teacher reaching out to every participant,bringing joy and enthusiasm to all was really min blowing....or should i say, JHHHAKKKKAS !!!! Yeah,you guessed it right...the teacher was none other than Anand Rajenderan...he had promised that all the sheep joining the course will go back as lions by the end of three days...and so it happened !!!\n\nThe padmsadhna sessions,meditations,Om namo shivay chantings....it was so blissful....and what we looked forward to the most was knowledge sessions by Anandji.Guruji's teachings were explained in such fun-filled manner and the best part used to be when Anandji used to point out the 'Pappus' from the crowd and they had to stand before the crowd till the time they started participating whole-heartedly.\n\nThe processes were amazing as usual.We had so much fun when guys were dressed like gals and vice-versa.Bhanu and me had so much fun eve-teasing...at the end of the process,all the men vowed that they will never ever tease a woman again :) Criticism process was an eye-opener in so many ways.Every process taught something new and helped in connecting with others as if they were my own.\n\nThe charisma of Anandji was witnessed in full throttle on the last day.Everyone was so over-whelmed by the Guru stories he told.That day i learnt the importance of 'giving'.Donations were raised for constructing a temple of knowldge in our city beautiful.Our dsn group raised almost 20 lakhs.there were tears of gratitude in everyone's eyes.till date we'd been living for ourselves but that day we realised what satisfaction one gets when we do something for the society we live in.\n\nThe course ended with a rocking satsang...we danced nonstop to the beats of the dhol....followed by rocking bhajans...and the award of the best dancer goes to...Anandji again...who set the floor on fire by his energetic dance.he danced with each and every participant and everyone was so excited to geta chance to shake a leg with their jhakkas teacher.\n\nSo, ladies and gentlemen – if there is a DSN course with Anandji nearby you, it is a must attend course. Do it to make a difference in your lives, in your families’ lives and for making the world a more positive and spiritual place!!", "gender": "F"}, {"text": "Rush of imagination !  Raman Varman tried to cross a check-post that he crossed daily while going to his office. But he was stopped by a security personnel who said, “Sir, Indians are not supposed to enter through this way. You may take the next turn instead.”\n“What do you mean Indians can’t enter. This is India. And it’s a silly check-post and not an international border !”\n“You are wrong sir. Do you see that statue there ?”, he said pointing to a far white statue that was crowned and had a torch in its right raised hand.\n“You are trying to enter America sir. And you know that the law...”\n“Whhhhaaattt...oooo...wow...aaahhaaa...” Raman’s involuntary expressions rose from wonderment to more wonderment before the security-man knocked at the window glass of his car, “You are obstructing the traffic sir!”\n\nRaman woke up in the midnight. He smiled, switched on the light, took his note book and drew a rough sketch of what he saw in the dream, closed the note book, switched off the light, smiled again, and slept.\n\nRaman was a medical representative (MR) and had quit 3 firms earlier all on the same unique ground that MRs should be respected by the company coz they are most crucial in making a deal with docs n hospitals. Al Toro Pharma was his current place of work.\n\nHe saw weird things in his dreams and painted the same ASAP before the prints of the imagination became too dull to be transferred to the canvas. One day he dreamt the Qatub Minar just adjacent to Taj Mahal. He was happy to bring entirely 2 rules separated by 300 years too close. He had dreamt the water of Ganga going up the hills. He had rented a hall every inch of which was full of deep non-sense that had originated in his mind in the past. The paintings sell for handsome amount, and Raman soon became a known image in the locality, and quite unlike the SENSEX, the radius of his popularity was on an increase.\n\nHe was uni-directionally paranoid the direction being that of his wife from where apart from the routine curses one day came a rotating a screwdriver that just missed Raman’s eyes! Yet he loved her very much coz except few hours in the day she too loved him.\nHis position in Al Toro became odd when he bought a Volkswagen- a machine that only earned envy for Raman. They say that you can’t but fall prey to the arrows of envy. And Raman was no exception. He decided to quit Al Toro, and establish himself as a full-time painter – a decision not in conformity with his wife’s opinion.\n\nBeing a full time painter of weirdness he would force himself to imagine insanities. He begins to avert truth and the general perception of the things. He would rotate his head and try to see the inverted objects only to confuse his mind as to what the reality is. He would try to imagine ordinary objects (like his Parker pen) as an exotic piece of excellence. He would find flaws in everything he saw, and wish if they could be as per his imagination. Surprises, he began to believe, is the most important thing that can keep you away from this general monotony of life. “Surprises”, he said, “is more powerful than happiness ... it keeps you alive !”. His public behaviour has come (declined) a long way - from humour to unwanted humour to objectionable humour to darkness and pity - a behaviour that created a mix of irritation and sympathy in those who confronted him.\n\nOne day he dreamt God speaking to him. He painted it being careless about the result. “Is God weird ?”, was a question to be answered. “What Mr Raman want to say through his popular non-sense is that God is weird !”. What Raman painted was a never-before imagination. This made many sectarians ask, “Is this a Hindu God or Allah or Jesus or Buddha or... ”. The point was if it was Allah then it was the sole responsibility of that community to object, and likewise for others.\nThe defence from Raman was, “God is not weird! It’s his talking to me that is weird. As in many of my paintings, it’s not the absolute objects that are weird, rather it’s their actions are weird...”\nBut the property of the mob is – it doesn’t listen to arguments if it has once made its mind (if at all that exists anywhere)! The carnival of absurdities (his Hall) was reduced to carnival of ashes (by fundamentalists) as the last amber grew cold. The outcome – it was proved that God is not weird! He protects himself through these agents who would commit all sins, but not hear anything against something in front of which they rotate incense stick in the morning.\n\nRaman did not go out for many days. He kept imagining and drawing on his note-book and oscillating brushes on the canvasses. His deliberate jumping into imagination became his habit, and soon his very character. It became hard for him to distinguish between a real event and a non-real. He would meet many distant people without going out at all! This was different from schizophrenia where you have a finite number of illusions playing around you. It appeared some strange case of hyper-reality, where the brain could deliberately detach itself from even the most known things.\n\nToday he decided to go out of his house and meet his friends at Al Toro and see the Raman Hall. Luckily he found the door of his house open for the first time since many days. He rushed out. Many men asked him to stop. They chased him. But he managed to escape. “God ! The world is getting madder day by day !”, he thought.\n\nHe changed his plan, and went to see his hall first. He asked a man nearby, “Sir, there used to be a Raman Hall here. Where is that?”. “Raman Hall? There was no such tower here. This had been a community centre since I saw it for the first time in 1981.” He had misunderstood the building he thought. He came out and inquired about the Hall, but all in vain. It getting dark, he returned to his house.\n\nHe entered his house, and surprisingly found that a thick layer of dust had taken the responsibility of protecting everything. He took something from the floor, and removed the dust from some parts. Newspaper. And it showed an edifice. Wait. “I have seen this place...Oh this is where I came out from in the morning. This is my house! ” . He removed dust further and saw himself going into the edifice with some policemen. He could not make out. He cleared all dust. The news read “Raman gets relief. Acquitted on ground of strange disorder. Taken to Protege Asylum.” The body of the news was hardly legible. He was tired. He cleaned a part of the sofa and lay there before he found a dust laden portrait, the garland of which were cocooned by spider webs, on the wall. He cleaned the portrait. It was of Lalitha’s, his wife’s.\n====================================================================\noh ! no ! kya bakwas hai ye yaar ! :( ... will write better nxt time. (mayank)", "gender": "M"}, {"text": " The scenery in Library at night. That's all I managed to capture before the Flaming Lamborghini came.\n\nAhhh where do I begin with the Flaming Lamborghini? How about the recipe? The ingredients are a combination of blue curacao, coffee liqueur (Bailey's and Kahlua's) and erm, yeah. It doesn't sound too bad, but drinking THAT was an adventure in itself.\n\nWhat happens is the blue curacao is lighted up and goes up in flames. Then they pour the blue liquid through a chute of sorts, and into a small shot of Kahlua's and Bailey's at the end. Once the coffee liqueur has flames on it's surface, you drink it through a straw, all in one gulp.\n\nGoddamn delicious. Hur hur hur. Really, really nice because I love Bailey's. (In other circumstances that would have sounded dirty.)\n", "gender": "F"}, {"text": " The schedule is bananas and I haven't had time to do ANYTHING yet! I'm hoping to catch a break tonight or tomorrow afternoon to get on my computer, clean out my email inbox and upload a few pics. So exciting! The kids are having a blast and the tour we are on is SICK.\n\nIt's a tour you can't BUY - It's only available through the CEO of Disney. We are being brought in through exits of rides and they are closing down stuff for us to eat in at night. They are supplying snacks and taking us into shows without having to wait on lines. It is incredible!! Oh and we can go on rides a few times - not just once. We get off and then hop right on again. People are very confused watching us!\n\nThey have this purple card that they show which is like SUPER DUPER VIP - they said it's how the celebs go through the park. I swear - it is SICK!!\n\nWill update more later.\n\n", "gender": "F"}, {"text": "Emotionally Spastic??  Vivek was walking to go to office when he saw a spastic person walking to catch bus for his work. Everyday he had been going same road to his job. On his way there was a small uneven area and that spastic person would fumble and Vivek if there would help him through the patch. That used to happen quite often, you know it was the same spot but the spastic person would fumble anyway, Vivek used to offer help but that person used to refuse.   Maya's husband is little hot-headed. He get angry over small things and there is a fight… Fighting over small issues is common for Maya now and she is quite frustrated about her\nhusband's behavior..\n \nwhat's the difference, we all have our weaknesses, some physical some emotional…\n \nIn fact people feel so much pity or bad about handicap people that they are more than willing to help but I don't know why same people are screaming about person who are emotionally handicap.  Maya's husband has a genetic tendency and I don't know how much we can really change our basic nature.  \n \nIs there a co-relation between these 2 stories ? Emotional weakness and physical one  are they on the same level ?\n\nMaya can't change her husband's nature but can she give him a helping hand?\n \n \nThere is one famous guy, who said \"Accept people as they are\". I kind of liked it…. I would stop complaining why he is failing whether in a physical or mental quality, you will feel like helping and that will solve lot of problems    \n \nThat spastic person or angry husband,  both are not ABLE to change but can we make other choice .. one that makes us happier ….", "gender": "M"}, {"text": "Faith - The other day someone remarked that I have too much faith in my Guru. Such remarks/comments do keep flying around me all the time. However, this time it set me thinking. Do I have faith in my Guru? And if so and if not, what is 'faith'?  H H Sri Sri Ravishankar, founder of The Art Of Living says \"Faith in the divine and faith in one's faith. You know everything is being protected, and everything is being taken care of.\"\n\nOsho said \"Faith is a leap into the unknown\".\n\nBoth these conceptualizations I could agree with. After all they have been given by spiritual masters ! But conceptualizations are done merely for the benefit of intellect driven humans trying to fathom truth through their cognitive abilities. My agreeing with them or disagreeing with them does not take me any closer or any farther from truth. As truth stands beyond what I agree with or do not agree with. So, do I have faith? Faith in whom, faith in what? Do I have faith in my Guru? Do I have faith in Him? Do I feel that He is with me? I am protected? Or better still do I feel that I am with Him? Both don't seem to be absolutely true. It is neither. Where is He? Who is He? If He is there then He doesn't seem to be with me and it doesn't seem as though I am with Him. He seems so distant. Yet He is!\nI stand there shorn of His proximity or distance. I am and He is! He is a part of me, an integral part of me, He is me !! Is it blasphemy to say He is me? I don't know. He is me.\nI am also shorn of all protection............ protection from whom, from what. All that is there is a part of me, it is me!\nIs this faith ??", "gender": "F"}, {"text": " So that wasn't so bad. Have had already 5 glasses (small) of beer and feeling supremely woozy. World was all fuzzy, glasses came off (so I don't break it) and face was hot as heck. Things were suddenly really, really niiiiiiiiiiiiiiiiiiiiice.\n\nI was talking a fair bit of crap too. Can't remember what I said but judging from the delighted faces of my colleagues, it must have been awesome blackmail material.\n\nAnd so there I was, singing off-key, swaying to the music (I was swaying anyway from the alcohol) and having shit-loads of fun.\n\nThen the Black Russian came. He took the rest of me to the toilet. In a good way. (Yeah, that sounds dirty NOW.)\n\nBut make no mistake. It was DAMN tasty too. (At this point, JA kidnapped my phone to update my Twitter in a most drunken manner, IT WASN'T ME.)", "gender": "F"}, {"text": "Kunti's Ghanti\nBefore I start writing on this I would just like to tell everyone that am not making fun or abusing history its just seeing today's IT/Corporate world this idea struck to me.\nWhatever I write in this blog its all imaginary :)\n\nWe all know how Karan was born?? OMG!! not Kyunki's but Mahabharata's Karan.Ill just give a brief recap courtesy: \"Wikipedia\"\n\nKarna was born to his mother Kunti by his father the solar deity Surya. Karna was born, before his mother's marriage to prince Pandu. When Kunti was young, the sage Durvasa visited her father's palace. She served the sage with utmost care for an entire year. Pleased by her service and hospitality, the sage foresaw her future difficulty after marriage of not having a child through Pandu, and hence granted her a boon to overcome this difficulty. By this boon she could call upon any god of her choice, and beget a child. Out of curiosity, Kunti still being unmarried, decided to test the power of the boon. She invoked the mantra and called Surya. Bounded by the power of the mantra, Surya appeared before her and granted her a son, who was as radiant and robust as Surya himself. This baby was born with an armour ('Kavacha') and a pair of earrings ('Kundala') attached to him. Though Kunti retained her virginity, she was unwilling to face the world as an unwed mother. She placed the baby Karna in a basket and set him afloat on the holy river Ganga in the hope that he would be taken in by another family.\n\n\nNow lets move to my View\n\nImagine people working in IT industry getting such boon or power.Oh life would become so easy or i should say mantr(a)i :) i.e if IT people have mantra called Kunti's Ghanti then it would be so cool...\n\nGuy working in IT industry is so happy to say my office timings are 8 to 5 so I get evenings.Is it true??Yes very much for few months atleast.Then he has to be isolated \"Main aur mera Manager types\".His friends start shouting at him on not coming to any trips,function,get together etc.\nHis gf/wife is like tell me if you are going to come for dinner then only ill think of making something; but think of it is it possible to inform at 6:30 in the evening that ill be home by 8:00??? No its not.Server might crash at 7:45 usually when cab is ready to pick you or at 7:40 your manager might ping you \"Hey did u get time to look into this\"??? If this continues how would people have family life?? Forget about life family atleast ?? :P\nThe other day I saw a kid in my society may be 5-6 year old kid his grandpa like came and took him for a ride I was surprised seeing grandpa taking a kid on a drive n all usually we see kid holding grandpa's hand and going to nana-nani park or a walk,but then I came to know that he was his dad and not grandpa.Result of starting late family or loss of (grey) hair due to work n tension.\n\nLet's see the following story\n\nA 30 year guy get married and tells his wife see we will plan our honeymoon a month later so that I can impress my boss saying seeing the work I have postponed my honeymoon and will get 1 month leave.What a plan??? Cool !\nAfter 3 days of marriage he goes to office and mails his manager for leave for a month.Week passes no reply,then he sends a meeting request to the manager for the same.Before manager could accept the meeting request manager calls this guy for some discussion.He tells seeing your dedication we are offering you onsite opportunity to london for 3 months initially I understand you have just got married but this also leads to your promotion so thought of having a word with you.Poor guy with a smile on his face and tears too goes back to his desk.\nThen he goes home and tells this to his wife;wife under impression that she would also go to london becomes happy (which is not really going to happen).Husband with all guts tells his wife see we can plan our honeymoon soemtime later as this is a good opportunity and I am thinking of taking it .\nNext day wife comes up with this Kunti's Ghanti and tells I have got this Kunti's Ghanti mantra which would help me till the time you are back :) It works the same way it worked for Kunti but this is more advanced with protection :)If i skip the protection part of that mantra there are high chances that I get pregnant; but am thinking of why not take Hrithik Roshan or Brad Pitt's name in this Mantra instead of you.\nListening to this husband faints!\n\nStory 3:\n\nOnce a husband returns home after 3 days of work and hugs his wife and say's I think we should start a family.Wife say's oh u had time to discuss this I already applied Kunti's Ghanti a month back thinking you might not have time to even discuss this..dont worry have taken your name and waiting for the result :)\n\nSaw how Kunti's Ghanti useful for early family planning?? :P", "gender": "M"}, {"text": "Gay rights pros and cons   we all have been listening about gay rights these days. Recently Delhi high court also agreed to make homosexual relationship as a legal act. Prior to this historic and a bit controversial decision homosexual activities were considered as criminal under section 377. But now a man can marry a man and a woman can marry a woman.\nSome people consider it right saying that we should not discriminate people based on their sexual habits. If some one is homosexual that is his or her choice and we should respect it. If we give their relationship a recognition in society then it will decrease the chances of unsafe sex. That will help in reducing the cases of HIV positive. Adding to that homosexual culture has gained a lot of popularity and it is not possible to keep suppressing them.\nAt the same time some people consider it is wrong. They say it is not our culture. It belongs to western countries and it suits them only. Some feel that it violates their religion and they are ready to do anything to stop it from spreading. Some politicians also have jumped into that thinking it may be another hot issue for vote bank. But still i feel that though many people in our country have their opinion about this issue not too many really bother about it. Specially those who are straight. So I just hope it wouldn't entertain politicians much.As far as religious feelings are concerned i will say that all the rules of all the religions were made by human beings only.So we can change them according to the need of hour.\nNow we have seen some people favour homosexuality while some oppose it. I kind a have mix opinion about it. Well if someone is not straight then I don't think he or she should be left out of the society it will only make things worse and yes at the end of the day its their life and they have right to decide which way they gonna live it. Straight or Gay (lesbian). I guess most of the youngster like me will be thinking the same way and they really don't mind homosexuality being legal.\nBut but but.............\nThere is something that can be really bothering. I guess first time I heard about this gay thing from some of my friend i was in 10th or 11th standard and my first reaction was how can it be possible. How can a boy love a boy or how can a girl fall with another girl. I thought he was kidding. Only after some time i figured out he was right. Well for most of us we heard about the homosexuality things a bit too late and by that time it was very difficult to think about loving same sex person. Because most of us never thought that other way round also could have been possible and by the time we came to know we were already fond of other sex. But the way it has gone and grown in India in last few years it is getting a bit dangerous. Still thinking why? well because next generation will be knowing these things from their childhood. We will find the cases of homosexuality increasing and its legalisation will make it even worse. Most of the people who are standing today for gay rights will not find it the same if their kids follow the unconventional sex(homosexuality) habits. Most of the celebrities and young people stood in favour of gays. But they will definitely not support some one of their family following the Idea.Well currently we see in some of the colleges management is very strict with boys and girls hanging around together.But what they gonna do about this whole gay(lesbian) thing?? forget about hanging around they will be in same hostel and may be sharing room as well.I guess parents too will be having nightmares.Stop the kid(boy) from going out with girls or boys. So we have tough time ahead with this gay stuff.Hope it goes fine...............", "gender": "M"}, {"text": " Chile Earthquake and Spiritual Promptings\nOn the LDS Church News website last week there was an article about the earthquake in Chile and how the mission there had already been preparing for an earthquake in the weeks leading up to the quake. The article is an e-mail written by Sister Lisa Laycock, wife of Chile Santiago East Mission President Larry Laycock, and originally sent to her friends and family after the quake. Here is an excerpt:\n\n\n\"When we were set apart for this calling, Elder [Richard G.] Scott of the [Council] of the Twelve Apostles taught us many important lessons. He spoke from personal experience when he was a mission president in Argentina. One message that he shared with us is this: 'At times, during your mission, you will be awakened in the middle of the night or the early morning hours with thoughts of specific things you should do for certain missionaries. Do not ignore these thoughts. They are promptings from the Holy Ghost who will communicate with you in the stillness of the night or the peace of the early morning hours. He will speak to you then because that is when you are still enough to hear.' Elder Scott further instructed us to keep a notebook beside our bed so that we could record these precious promptings. He said that by the next morning, we would be likely to forget the promptings if we didn't write them down.\n\"We have been astonished at the fulfillment of Elder Scott's prophetic words. We have received many promptings in the exact manner that Elder Scott described. We are so thankful that Elder Scott taught us how to recognize and act upon these precious promptings. Had he not taught us, we may not have given these promptings the attention they require.\n\"Nearly two and one half weeks [before the earthquake], I was awakened at around 4 a.m. by just such a prompting. I did not hear a voice, but the thought was as clear as if it had been in the form of spoken words: 'There is going to be an earthquake. Prepare your missionaries.' I sat up in bed and immediately remembered Elder Scott's counsel. That morning I told Larry what had happened. He immediately set to work organizing our missionaries to prepare for an earthquake.\n\"In talking with our office missionaries to arrange for them to put together a list of everything we would need to prepare...in both Spanish and English...we discovered that the Lord had also let two of our office missionaries know of the possibility of an earthquake (in the form of dreams) and the need to prepare our mission. We set a goal and arranged our schedule so that we could visit every apartment in the mission to check for safety and to review with our missionaries what to do in case of an earthquake. What a wonderful experience we have had as we have met with them and shared scriptures with them about being spiritually and physically prepared. '...if ye are prepared, ye shall not fear' (D&C 38:30). We instructed every missionary to have a \"go-bag\" (36 hour kit). We reviewed our emergency action plan with them of where to go and what to do if they had phone service and in case they did not. We gave everyone a paper with all instructions in English and Spanish, and we reminded them that 'this life is the time to prepare to meet God' (Alma 34:32-34). We shared with them our thoughts and feelings about the need for spiritual and physical safety. Some of them became frightened and asked us if we knew something they didn't know. We smiled and repeated '...if ye are prepared, ye shall not fear.' We didn't want to unduly alarm them, but we did want to impress upon them the need to be prepared. We tearfully reminded them of our recent transfer conference where we had shared our feelings about our dear Elder McKay Burrows who was unexpectedly called home in January while serving his mission in Romania...how he was prepared in every way to meet God. We reissued our challenge to 'be prepared' in every way. Then we knelt with them in their apartment and dedicated each apartment, asking for a blessing of safety and security to be upon every apartment.\n\"When the earthquake came, we were prepared. We did not experience the panic that many felt. We knew we were prepared. Because of the words of the Lord's chosen apostle, Elder Scott, we had listened and heeded the quiet, but clear promptings of the Holy Ghost. We were blessed with peace in the midst of chaos. We learned an important lesson: our preparation helped us to avoid panic and fear, but the Lord, in His wisdom, allowed us to experience enough discomfort to know that He has all power. He is in charge. We are nothing without Him. We are dependent upon Him for every breath we take. Only He can save us from death and destruction. He is the way, the truth, and the life. He is our perfect example. If we follow Him, we will be saved through obedience to the laws and ordinances of His Gospel.\n\"As the earthquake became more violent, the mission home groaned and wailed. The power died, so the whole city was black. The windows made a hideous screeching sound, and flying objects banged against swaying walls. The printer/fax machine, books, book ends, and fifty-pound television burst from the entertainment center and crashed to the floor, cabinets emptied, drawers flew open, the refrigerator moved, water sloshed out of the toilets, the floor jolted up and down as we ran across it trying to hold onto the walls to keep from falling down, and the piano toppled over like a small toy. As we made our way to the back yard, I remember thinking, 'God is all-powerful. He is our only refuge from this horrible mess.' I prayed and prayed for Him to still the earth. When we reached the back yard, we watched in terror. By the light of the moon we could see the swimming pool water form giant waves and crash out onto the rocks. House and car alarms screamed into the night...some from being crushed by falling debris and others I guess from the bizarre movement of the earth. I am not sure if the intense rumbling sounds came from the earth itself or from everything else that was shaking so violently. Finally, it stopped. When the calm came, we had to sit down because our legs were weak and unstable. My legs stayed wobbly all day and night yesterday. Today (Feb. 28) the muscles in my legs hurt like I ran a marathon. The aftershocks have been extremely unsettling. Each one begins like the one last night started. We just close our eyes and wait to see if it escalates or dies down. I have never experienced anything like this!\"\nWow! The description of the earthquake was pretty cool to read, I don't think I would ever want to experience that myself. But the description of how the mission was already preparing for the earthquake was even more amazing. Heavenly Father really cares about us and he does provide us with spiritual promptings if we care to listen. What would have happened if this sister and the other missionaries had decided to ignore the prompting they received? I'm sure all the missionaries and their families are grateful that the three individuals who received promptings to prepare for an earthquake were in tune enough with the Holy Ghost to realize that it was a warning and take action.", "gender": "F"}, {"text": "Is uncle \"SAM\"behind \"TERRORISM\"????  -  It is my debut in blogs and i was thinking to do it long time ago but cannot.Now I have started it ,then I thought on what thing should I start. To tell u when I was thinking about this,in front of me the times of india home page was open and some clip of respected Manmohan Singhji and Mr. Ahmad Raja Gilani was open in which they were talking to each other in NAM summit.straightaway I thought that I will write on most important and dreadful and horrifying problem we are facing (I guess more than Global Warming) and that is TERRORISM.\n\nIt has been blamed that Pakistan or other countries in central Asia have initiated Terrorism but is that true ???I do not think so...These countries are all the scapegoats..then who is the master???yes absolutely correct ..it is uncle SAM.I am just not not crapping here ,I am telling u the truth.Pakistani author Ahmad Rashid in his book states that in 1986 when Soviet Union was in war with western countries especially U.S. then the inititation of organised militancy was done.\n\nIn this book it has been stated that in 1986 U.S.'s Central Intelligence Agency(CIA), Britain's M16 and Pakistan's InterServices Agency(ISI) planned to launch mujahideen attacks in Soviet Union and most of the funding was sponsored by uncle SAM.Now the question is that why are they afraid of aftermaths of the things they have done ???you have to be brave enough to face the things you have done .Now the twin tower attacks triggered their adrenaline and they started attacking here and there creating more terrorists then stopping them.There had been excessive killing in these in 8 years andits not acceptable and its just not only about stopping terrorism.its also about playing the oil game and winning it too.really hats off to uncle SAM and I am also still suspicious that was twin tower attack really act of Terrorism or it was game played by the clever mind of uncle SAM.You never know because when they create moon on earth then it can also be done.\n\nThese things have to be thought about and or the solutions have to be sorted out otherwise towers were in their own country then it can happen to any other.I am not blaming only one country but we should be ready for stopping it....", "gender": "M"}, {"text": "the pune visit It has been really killing me. 6 months long semester is like marathon race and if you were taking mid sem exams on Saturdays and were kept on your toes on Sundays as well then you can understand what I went through. It wouldn’t be wrong if you say I was workaholic in last 7 months. So I decided to take 8 to 10 days break. And I decided to go for pune as I have always liked this place. So let’s see what happened there.\nI got ticket for a direct train from trichy to pune and I decided to board in that train in spite of the fact that I would reach there sharp 2 a.m. because that was the only train that has seats available. When it reached some place called Sholapur in Karnataka or Maharashtra people started closing and bolting the doors and windows. I asked what the matter was. Someone told me that some people may come to rob the train with swords and guns. He also told that last time he traveled through this train and robbers came and robbed the train. (What the hell. That is why I got the tickets for this train. There were 4 or 5 constables also in the train with guns to protect us). But I think it was my luck so nothing happened. I spent most of my journey reading my novel or watching out of the window. (No hot chicks to check out :().\nI was praying my train to be late as I was going to my sister’s home in pune and she and my jiju were to come after 12 in the noon. But they left keys for me with their neighbors. But I couldn’t have gone someone’s home at 3 a.m. in the morning to ask for the key. My train reached on time. So I thought I should rather wait on station. There is one nice restaurant on station (I don’t remember the name as usual). It is 24*7 restaurant and its kind a place where you would love to go and have something. I have never seen such restaurant on any other station. I went there to have something and pass my time. Suddenly when I was on counter I got a call from my friend. He is studying in Lonavala. Dude 2 a.m. in the morning and he is calling he must be here somewhere I thought. I picked and he was seating behind me. We had a long chat, some food and coffee. I was meeting him after 3.5 years. I guess the World is really small. He had his train at 4:30. So we chatted for 2.5 hrs. I left at 6 a.m. and reached home around 7 after struggling with auto walas.\nOne day I spent sleeping and rest 3 were spend in seeing the beauty of pune. Now you must be wondering what is so beautiful in pune. Yup there are no tourist spots like in some other places. But city is full of youths and things that attract youths :). I played a lot with piyush (my nephew). Last time I saw him he was not even 1 year old. This summer he will turn 3. Kids and food are hard to resist. My taste buds were happy after long time. So I played a lot with him and also ate a lot. We sindhi are known for our passion for food and clothes. I haven’t seen anyone else spending as much money on food and clothes as we do. And our food can’t be finished without dessert. So I was loaded with a lot of stuff. I also went to my cousin. He is currently working in CRL (part of tata group)in pune. That is a lab where World’s 4th and Asia’s no. 1 supercomputer is kept. He told me a lot about his work and supercomputer. Though I couldn’t go to his lab as visitors were allowed on Saturdays only and I was heading for kalyan(1 hr form Bombay) before that. We went for movie (avatar) one evening. We thought as it is a week day we will get tickets. But we couldn’t get for evening as well as night show. We went for next day morning show (8:30 a.m.). Well pune girls were quite fashionable and I didn’t miss any opportunity to check them out. 2 years back when I went to pune their shorts used to be below knees but in these 2 years they have come above knees. I don’t know where they will be in next few years (lol :D :) ). Pune was chilly in morning and nights. But still when we went for the morning 8:30 show girls came wearing shorts and sleeveless. I realized that its quite tough to be a girl in a city like pune :D. These girls were no less than fire in a chilly morning. Anyways we went for the movie. I read a review of the movie somewhere before watching it and it said “you have never seen anything like this before” and yup these words were quite true. I saw it in 3D and found it to be really awesome.\nAfter spending 4 or 5 days I left for kalyan and spent couple of days there. I booked the window seat in the train so i could enjoy the beauty of Lonavala and Khandala. Both the places are beautiful but if you want to see its true colors you should go in rainy season. I also had plan for Bombay but couldn’t go. In kalyan again most of my time went in talking to my cousin and wandering in shops and streets. I and my cousin discussed a lot about our college lives and all the funny stuff. Couple of years ago we two were youngest in our family until some offspring came and snatched our title :(. Anyways we are still the rock star of our family I guess :). So we had good time.\nAll good things come to an end. So was this trip. :(. But I had good time there and put on some wait too. :(. I hope mess food will bring me back to normal size.", "gender": "M"}, {"text": "One of India’s six largest IT outsourcing companies. Counts such Fortune 500 companies as Sony among its customers. The biggest corporate scandal in India. More than $ 1.5bn of investors’ money dwindled thanks to one family. Rather, one man who famously said, “It was like riding a tiger, not knowing how to get off without being eaten”. Ya, right. Its my !@#$%^ money, you moron! But guess what’s new? The man is happy, leading the life of a King, though he’s still a B-class prisoner. A B-class prisoner is a habitual offender or a professional crime-doer. Someone who can harm the society in a greater way. He is expected to share his cell with another prisoner. And the well known rule, is that NO electronic gadgets are allowed inside the cell. Our Constitution happens to be the longest and our country, the biggest democracy in the world. “All Men Are Equal Before Law”, did they say?  Some equality, I tell you. A man died in custody after being brutally beaten in the Neelankarai Police Station day before yesterday. For a silly domestic issue. And here’s Mr.SmartyPants who gobbled up MY bloody money, eating a 5 course dinner.", "gender": "F"}, {"text": " As a blogger of only a few weeks, I'm learning there is a certain etiquette for blogging. (I just scratched my head trying to invent a word like blogiquette, but it didn't quite work as it turns the G into a soft G.) In my surely deluded mind, I'd get hundreds of followers and comments alike, full of praise for my irreverant (am I deluded again?) style of blogging. As I said, this was in my mind. \n\n\nWhat I have learned is this: You won't get followers if you don't follow others. That actually sounds like a life lesson as well doesn't it? Same for comments. So I started following and commenting, and guess what, yay, I got followers and comments. This may be obviously to you lot reading this, but it wasn't to me. I'd previously been used to blogging on my own website for my 4 year old son, full of pictures of what he'd been up to. My readers were my family and friends, living too far away to see us regularly, able to catch up on the blog. But I'd not had to earn readers. I am slowly appreciating that I now have to.", "gender": "F"}, {"text": " Haven't posted here for months. All sorts of reasons and, simultaneously, no reason at all. It happens or it doesn't. Many's the time I've started writing a post and it's never come to fruition. That's just the way it goes.\n\nThere've been all sorts of lovely and important cultural events since I last posted. Maybe I'll get round to talking about them, maybe I won't.\n\nI'm not long back, this evening, from a standard (I'm thinking of it as equivalent to Classic Coke) Duckie in terms of both Readers Wifes being present and correct. Amazing music, played in just the right order, some of it having gradually accreted danceable fabulousness over time (MGMT's Kids) and a good dollop of old favourite loveliness.\n\nAmy commented on there being a \"Back To School\" vibe and, although my own work is constant through spring, summer, autumn and winter, I can see where she's coming from. ", "gender": "M"}, {"text": "Buddha, one day, was on deep thought about the worldly activities and theways of instilling goodness in human.The following is the text of conversation between him and his disciple  One of his disciples approached him and said humbly \" Oh my teacher ! While you are so much concerned about the world and others, why don't you look into the welfare and needs of your own disciples also.\"\nBuddha : \"OK.. Tell me how I can help you?\"\nDisciple : \"Master! My attire is worn out and is beyond the decency to wearthe same. Can I get a new one, please.\"\nBuddha found the robe indeed was in a bad condition which needed replacement. He asked the store keeper to give the disciple a new robe towear on. The disciple thanked Buddha and retired to his room.\nThough he met his disciple's requirement, Buddha was not all that contended on hisdecision. He realized he missed out some point. A while after, he realized what he should have asked the disciple.\n\nHe went to his disciple's place and asked him \"Is your new attirecomfortable? Do you need anything more ?\"\nDisciple : \"Thank you my Master. The attire is indeed very comfortable. I need nothing more\"\nBuddha : \"Having got the new one, what did you do with your old attire?\"\nDisciple : \"I am using it as my bed spread\"\nBuddha \"Then.. hope you have disposed off your old bed spread\"\nDisciple \" No.. no.. master. I am using my old bedspread as my window curtain\"\nBuddha \" What about your old Curtain?\"\nDisciple \"Being used to handle hot utensils in the kitchen\"\nBuddha : \"Oh.. I see.. Can you tell me what did they do with the old cloth they used in Kitchen\"\nDisciple : \"They are being used to wash the floor.\"\nBuddha \"Then, what about the old rug being used to wash the floor...???\"\nDisciple \"Master, since they were torn off so much, we could not find any better use, but to use as a twig in the oil lamp, which is right now lit inyour study room....\"\n\nBUDDHA SMILED IN CONTENTMENT AND LEFT FOR HIS ROOM.\n\nWe all are blessed to have a living example in our life in physical form.\n\nJaigurudev !!!", "gender": "M"}, {"text": "Hot,hotter and hottest Chennai has finally turned into a better place.Thanks to the showers! But despite the rare downpours in Chennai, a few people still despise the rain. I’ve always wondered why people don’t like the rain. Rain enlivens the lifeless earth, gives a fresh look to the otherwise dry leaves, ensures a free supply of  ‘water-the elixir of life’ throughout the year and above all isn’t it beautiful ? Rain has served as an inspiration for many poets independent of the language in which they write. Rain songs have become a part and parcel of every movie just like the item numbers.And, invariably the Rain song is a definite hit! Not just a hit, most rain songs are beautiful too.Is it just the music that brings the beauty ? Definitely not.. Its the rain itself which adds beauty to the song.The rhythm of the rain drops falling, the crystal showers filling the place, the beautiful heroine dancing in the rain.. (does she dance to the song or to the rhythm of the rain ?? .. I’ve always wondered! ) Isn’t it magical ?", "gender": "F"}, {"text": " Seems my sRGB conversion was causing that fireflies from previous images.\n\nBtw. I was wondering why the farthest I've ever get in ray tracing (excluding fixed path MLT in C++) was when I was using OCaml. Say what You want, but that functional language thing fitted ray tracing very well. Also, but that's maybe caused by my nature - now when I have dozens of ways to implement something I start to wonder what way to choose, what would lead to better design. Too many options confuse me, and slow me down big time.", "gender": "M"}, {"text": " When I look back at who I was and how green and naive I was when I entered seminary and first approached the ordination process in the Episcopal Diocese of Massachusetts, I am astonished that I made it through the selection process. I believe it was only because the Church's discernment process at that time was rather loose and lacking in rigor (and also rather still functioning as the \"old boys' network\" now having to figure out what to do with women).\n\nThere was still plenty of confusion, mixed messages, and what might, at least in retrospect, seem like warning signals that I did my best to ignore.\n\nThe discernment committee suggested that I do a year's internship in a church (five years in a non-church job might have been more appropriate!), because, they judged, that I was \"too sweet and inexperience, at least in appearance\". While the bishop in charge of the ordination process told me to \"go on being your own sweet self\"!", "gender": "F"}, {"text": "Big things around me! FB... it has more online users than google!\nread again.. -GOOGLE- !!\n\nIslam.. 235% growth rate ..and they it says 99% of hell is occupied by women.\nPeople love all what they say?\n\nJob switches and Job offers.. both requires experience.. deadlock?\nGrowth should have a separate path?\n\nFriends.. defined most precious.. shouldn't every1 be satisfied.\nprecious is ..what? satisfaction is ..what?\n\nSRK-vs-Aamir.. biggest topic for bollywood, and wht about nasrunddin shah, om Puri, Pankaj kapoor etc?\nBeing scholar doesn't pay you?\n\nSmoke.. menz passion!.. and they switch brands to 'choti goldflake', when they find their brand costly. \nAddiction is reality?\n\nTigers.. Aircel Tress.. Idea what a promotion sirjees.\nanything in return they want to save tigers and trees? \n\nDeepika padukone.. More famous than her father and shez in 'Phir Mile Sur' and spends more time (almost naked) than many great Indians like aa ..amm.... oops\nIdol for youngsters?\n\nKaran Johar.. stupid director.. still he is getting hit world wide accross languages.\nGood director?\n\nChrome OS.. access your desktop from internet.. great feature provided good netSpeed!\ndo we read the disclaimer/terms&Conditions?\nPS: anything saved at gmail is a copyright to google.\nand, Google desktop will provide 'save all your documents/songs/movies etc. on server'", "gender": "M"}, {"text": "In both of the shows, the main character is portrayed as an ordinary person who is so much passionate about playing football.They at the beginning do not have that much skill in playing football but the unending passion which they have in their hearts make them play with so much talent that people think it its an inborn talent in them. I too am a normal person. Well, a little big for my age, not having that much stamina or any sorta skill in football. So its no great thing that I was but a defender when we played for fun at school. Seeing those 2 shows, for some reason, made me grow really passionate about that gr8 game. It made me think that I too want to be a player, have fun on the field, hit goals and what not! How I want to play in the International Field with the players like Ballack,Ronaldo,Ronaldinho,Robben and so many others.Well If not with them at least against them :) How I wish I could score against great goalies like lehmann and Buffon.", "gender": "M"}, {"text": " When shooting outside at or around twilight, it’s pretty important to know where the sun’s going to go down (or where it’s going to come up). It’s easy enough to look up sunrise/sunset times, but the sunset/rise moves across the horizon throughout the year.\n\nThis took some digging to find, but it’s actually very easy to figure this out. You’ll need:\n\nThis link to the NOAA Solar Calculator\nA compass, which you can get pretty much anywhere.\nThen do this:\n\nFind your location (the location where you’ll be at sunse) on the map in that link\nEnter the date you’re interested in\nNote the sunset time. Under “AZ/EI” you’re getting a degree measurement, which is what we need eventually; but it’s actually showing the current azimuth instead of the azimuth at sunset.\nEnter the sunset time in the time fields next to the date fields. The AZ/EI field will update. That’s the number you’ll need.\nThe number you’ve just found should be a degree measurement, between 0 and 360. This is the solar azimuth angle at sunset. Generically, an azimuth is an angular measurement in a spherical coordinate system. The solar azimuth is calculated (by the application at that link, anyway) as the number of degrees clockwise from true north that corresponds to the position on the horizon that the sun is directly above. If that seems confusing, it’s because it is. On the bright side: it’s really easy to work with when you get to where you want to shoot:\n\nWhen you get to your location, take out your trusty compass and:\n\nAlign the compass with magnetic north\nFind the degree measurement on the compass that matches the number you got earler\nThat direction is pointing toward where the sun will go down.\n\nThere’s definitely a margin of error here. First, this doesn’t account for topography getting in the way (if you’re next to a mountain, the sun will go behind it long before it’s “down”, so the angle will be off). Second, the compass is reading magnetic north instead of due north, and the reported azimuth is measured from due north. But: it’s free, it’s pretty easy, and for my purposes, it’s good enough.", "gender": "F"}, {"text": "EU Commissioner alive on video  Do you, like me, sometimes feel that the EU is a faceless colossus with innumerable bureaucrats that you have no idea what they are up to?  Well, some commissioners have now understood the power of online video. Just check out this weekly video from the EU Commissioner Viviane Reding.  “I want all Europeans to be able to switch their phone operator â€“ whether mobile or fixed â€“ within one single day” A worthy cause indeed!\n\nHere you see a very human EU Commissioner and you feel her enthusiasm and drive for the issue she is presenting. The video is simple, but professionally done, she is reading well from a teleprompter.\n\nWhat a difference compared to just reading her press release!\nWhy are not more leaders using online video like this?\n\nSo I think this way of communication is exemplary, but there are someÂ  things that can be improved:\n\nThe video player should have an indication on how long the video is. This is essential, I want to know if I have the time or not available.\nThe video player should have an embed-button, so that it is easy to embed the video in blogs and other web sites. This creates viral spreading.\nThe text of her speech is downloadable as a PDF with a link next to the video. It would have been better to be able to read the text beside the video. Ideally the text should be navigable so that you can click on it to make the video jump to that part, like New York Times is doing.\nThere should be an RSS feed so that I can subscribe to these videos in my RSS reader.\nIt would have been nice to enable some form of viewer interaction. For example, have a poll about the issue mentioned, or allow comments to the video.\nWhat do you think? Please comment!\n\nUpdate April 3: I just received an email from an assistant to Ms Reding, thanking me for my email where I praised her for using video like this. I had not expected any reply, except maybe a short standard email response. So I was surprised to see that the email contained this image of a scanned letter: ", "gender": "M"}, {"text": " DELIVERABLES VS. DELIVERY \nWireframes, flow diagrams, personas, card sorts, content strategy documents, etc. All of these things are important to design, and designers need some combination of them to synthesize their user research and communicate what they’re doing with the other members of the team.\n\nBut too often these deliverables are the last line of contact for designers. Too often these deliverables are what designers prepare and then hand off to implementors. Then they shuffle off to create more deliverables and the cycle is repeated.\n\nIn the end deliverables are merely artifacts of the design process. They are not the final design, they are not the artifact of experience. The end user never interacts with them…they interact with the product or service that is actually delivered.\n\nThat’s the difference: deliverables are divorced from delivery.\n\nThus, the task of a UX designer, in order to stay true to our calling, doesn’t stop at any deliverable. Even if our “job” is to create wireframes, we cannot be satisfied with passing off wireframes to other team members. If we are truly concerned with the experience of the people who use our product/service, we will infiltrate their world…we will demand to know the quality of their experience.\n\nMany UX designers are judged on the quality of their deliverables. This is necessary to a point, we must make sure each step is faithfully executed. But to truly be a user experience designer, we must have a longer scope. We can’t stop at deliverables. We must extend through delivery.\n\nDeliverables are diminishing in importance. Sketches, super important to early design synthesis, have fleeting value. They are valuable for a very short period of time. Design, implement, iterate, move on. Record the learning, but don’t judge the sketch, judge the resulting experience.\n\nSo, if you’re not involved in the day to day feedback loop of your user’s experience, make sure you get involved. Ask about your feedback channels: support emails, call-center requests, twitter mentions, all of it. Do regular surveys and user testing. Investigate. Demand data. If you don’t, you’re just creating deliverables and missing the forest for the trees.\n\nExperience, in the end, cannot be captured in a deliverable.", "gender": "M"}, {"text": "My youngest brother does not have much of a memory for directions and maps. While this leads to some friendly jibes about his lack of that so-called \"manly\" trait of the compass in the head, so to speak, it led to me to think about this whole notion of \"necessary skills\". So when I can look up directions on Google maps from my mobile phone, or have an in-car GPS system give me directions turn by turn and even notify me of traffic conditions, is a sense of physical direction an important skill any more?  I look back and realize that technology trends tend to define what skills are \"in\" or \"out\". I have forgotten the art of memorizing phone numbers, because we know share contacts through bluetooth, text messages and missed calls. Come to think of it, I have also lost the unique Indian skill of being able to buy a black ticket at a crowded cinema when the box office tells you that the tickets are sold out. That's because I buy my tickets and choose my seats online now. A few years back, I was part of a technical interview panel for my company, grilling some poor people on the basics of C++ and Java. And since I do not enjoy making people squirm, I left with a very bad taste. I decided then that it made no sense to ask somebody the \"difference between overloading and overriding\". If I was asked a question like that at a job interview, I would pull out a laptop, connect to the internet and show the interviewer the answer that I pulled up from Google. I fail to see why Indian IT services firms still continue to test people for their ability to memorize Kernighan and Ritchie's memorable tome. Memorization is a skill that's most definitely \"out\". Information is freely available and searchable. So let's stop testing for information and start testing for knowledge.", "gender": "M"}, {"text": "The other day a random thought crossed my mind while scanning through some photos of a friend…When was the last time i opened a album ? (i mean the paperback ones) God,it’s been so long ago..I can’t even remember now..Digital camera’s just spoilt us crazy..  I remember when we would just click pictures with our Minolta camera and wait desperately to receive the photos from the studio just to see how they turned out…That excitement is dead now..No curiosity ..nothing   Forget the inquisitiveness,that is an attribute long dead anyway…but the fact that you can sit on your favourite chair with a photo album and a cup of tea to remember the funny and happy times on a rainy evening..is just priceless…  I am not against digital camera’s…I love them! But the feeling when you can open  an album and reminisce is extraordinary…   Now for the smart ones out there..yeah yeah..just print the photo out…(i know that!) …but really how many of us do that? we just keep gaping at the photos on our laptops …!!!   I miss having pictures adorning my wall!  Pictures of you…and me  ", "gender": "F"}, {"text": "A Billion IDIOTS!! - Before I went to see 3 Idiots , I had heard a thousand people chant about the brilliance of the movie. So , amidst all the hosannahs and eulogies that i heard chanted about the film , all the frenzied applause by everyone whenever the name of the movie was mentioned , I went to see the film at last. And did 3 Idiots live up to my expectations...??\n\nAs a movie... YES. A perfectly made , celluloid entertainer. Every performance was exceptional for its sheer energy and versatality. So , As a cinematic adventure , Hirani and Amir hold the story together perfectly.\n\nBut , 3 IDIOTS , for all its fine comic moments , is a very dangerous film. The movie legitamizes a scorn and hatred of education. It ridicules the best education institutions set in INDIA , sanctions wilful dumbing of our own. It shows our higher education system as an arena of bad teachers determined to ruin the student's lives , suicidally pressurizing students.\n\nAmazingly , a film whose central message is \"the education system sucks\", \" we earn nothing at our centers of excellence\" , \"dont study hard jusst do what pleases you\" is being hailed as the best film ever made in INDAIN CINEMA. This huge popularity of the movie shows how eager we are to embrace mindlessness and how keen we are to see education and hard work as obstacles to enjoying a good life.\n\nWe keep chanting the mantra \"the-system-sucks , who-cares-about-grades , the-rat-race-is-foolish.\". Yes our education system needs reforms , things need to improve but in the pusuit of educational reforms , we cannot allow standards of excellence be lowered. The IIT's must be applauded for the world-class minds they've thrown up , they are institutions that are respected all over the world.\n\nThere was a scene in the film in which Rancho mocks the Laplace Transforms (the equation written on the blackcoard) as an example of rote learning. Yet, without Laplace Transforms , Hirani's computer would not boot up!! As an Engineering student, I have never come across a teacher like VIRUS nor have i ever felt the manic stress during the 3 years of my college life.\n\nLet's get real about higher education , and not engage in an escapist fantasy and convince ourselves that education doesnot matter. For each of us, geniuses or not ... there are no short cuts.\n\nSo , THREE IDIOTS IS A GREAT MOVIE!! BUT THAT'S JUST IT ... IT'S NO MORE THAN A STORY.", "gender": "M"}, {"text": "Yes, there’s a pattern in the plots of all his books. But that’s how it is for 90% of writers across the globe. The bad ones included. We’re all people who wish to express ourselves and that shines through our words. Have you ever noticed that you use a limited set of words in your life. This even if you might have mastered your copy of Barron’s to flog the US consulate later. You think he’s all fascinated about the IIT/IIM atmosphere? Welcome to the world of Indian Chick-lit. India is one crazy nation churning out engineers mindlessly. Parents throw their kids into IIT/PMPD coaching centres in 7th grade. Why, it starts with Abacus classes in 1st grade these days. So why not? We’re talking of a sizeable target audience here. And besides, if we could lap up Miss.Kaavya Vishwanath’s stolen tale simply because A.She’s an ABCD and B.She’s from Harvard, I don’t see a reason not to love Chetan Bhagat. My personal favorite. I adore his female lead characters. They’re not silly nitwits (there are other women to make up for it) but are bold, career driven and they know exactly what they want out of life. Which, is the reality today.", "gender": "F"}, {"text": " Holiday Sneer \n\nIt's always funny to me when people wish me a merry Christmas. I mean, I can understand the whole holiday spirit and cheer and whatever, but the whole thing means nil to me. However, I did watch so many hours on the Discovery Channel about the life of Jesus, Mary, and everything else surrounding the New Testament that the Disocovery Channel could muster. I watched so many hours, in fact, that I had a dream last night that I was Mary, Noah (of the Arc), and Jesus rolled into one. \n\nFor Xmas eve I went over to my friend Ridge's house in Queens. We watched Peanuts cartoons, Edward Scissorhands, and ate Jumbalya or whatever it's called/spelled. Afterwards I headed back into the city a little earlier than planned and had a quick drink with Marc. I also tried to climb into his suitcase so he could take me to Australia with him for when he goes to interview the Vines. As I was heading back home, my brother Lawrence called me just as I was driving past him on the street in my cab. I jumped out and joined him for a drink at some cheesy club that was hosting a Matzoh Ball. It was so incredibly lame (I yelled out \"Sausage Fest!\" as i walked in and got shot with dirty looks all around) that we left after 20 minutes. He headed off to the new Crobar and I went home. Apparently the Lubuvatch Organization were in their Mitzvah Mobile outside of Crobar trying to recruit new followers of the ultra-orthodox jewish cult-like group. When I was little my mom used to take me to visit Rabbi Schneerson (sp?) who is the person the Lubuvatch's look up to as a sort of profit. We'd wait in a long line in Brooklyn for hours and hours and walk up to him, hand him a dollar, he'd give us a blessed dollar in return, mumble something or another, and then we'd go off on our way. I was about 8 years old when we did this, so my memory is a bit cloudy... however, I'm sure he brought happiness to a lot of people. I'm just confused by what the Lubuvatch community is trying to do with their Mitzvah Mobiles... i should do some research. \n\nSpeaking of Lawrence, he changed his friendster photo to images from high school. He was so fucking cute and new wave. Look!. \n\nYesterday, for Xmas Day, Nate the fabulous Roommate, cooked an amazing meal for his bandmates. It looked amazing... I couldn't eat it cause it wasn't kosher, but basically it was chicken rolled with ricotta and feta cheese, mashed potatoes, and asparagus. Nate cooks! He's like the best boy in the whole world. He also got a Christmas tree for the apartment which he decorated with white lights and blue balls (to pay respect to Hannukah), and we made an angle for the top using an image of Thom Yorke i found in Blender magazine. \n\nAfter dinner I went to the movies with Karen and Jordan to see \"Big Fish\" (I was crying like a pms-ing girl who has just watched a Sally Struthers \"kids in africa need your money\" commercial at the end... not to mention squealing everytime Ewan came on screen). We all noticed Drew and Fab in line for popcorn behind us and so this prompted Jordan to ask quite loudly while we were sitting down \"I THOUGHT DREW AND FAB WERE OVER?\" not noticing them sitting two rows directly in front of us. God Bless Jordan for delivering the quote of the night. So Drew and Fab are back on! \n\n \nWhen I got home, after going to Lit, I watched the World Idol competition that i had taped while at the movies. I'm totally in love with Kurt from Norway's performance. He was so utterly amazing. He sounded a lot like the singer of Kent. I think i'm gonna buy his album. \n\n \nFree Jack White items are for sale just in time for belated holiday gifts. Incase anyone is interested, i'm a women's medium. Thanks to Rachel for that link. \n\nFinally -- I'm DJing at Don Hills on New Years Eve. The party is apparently gonna be really great, so if anyone reading this needs something to do that night, you should go. Come and say hi to me if you do! I will probably be very drunk and possibly try to make out with you and then you'll also discover my inability to remember anything and total need to document everything with my digital camera as a result. I promise to also play \"Ice Ice Baby.\"", "gender": "F"}, {"text": "A to Z layoff.. \"WARNING\" A: please do 'this' for me\nZ: yes sure, my pleasure\n\nA: Hi, can u do 'this' for me....\nZ: yes sure...\n\nA: Hi, do 'this' for me...\nZ: OK\n\nA: Do 'this' for me.\nZ: OK 5 minutes\n\nA: need 'this' ASAP\nZ: will be done ASAP\n\nA: need 'this' ASAP, inform when done.\nZ: OK {after sometime} needful has been done\n\nA: please tell me the procedure to do 'this', so that the communication gap is not involved in the process.\nZ: Here is the 'procedure'. In case of issues contact me\n\nA: 'Issue'\nZ: 'Resolution'\n\nA: Hi Z, what do you do here...\nZ: 'this'\nA: 'this'? I know 'this', what do you do?\nZ: nothing!", "gender": "M"}, {"text": "It has become a common sight to see children as young as 5 years old in the spotlight singing and dancing to the latest film songs, dolled up in fancy clothes and layers of makeup, trying to behave very much like adults- tinsel town adults at that. While the tremendous talent demonstrated by most children is truly amazing and applaudable, it is debatable whether it is ethical of us to push children into a commercial world of make believe, where their talents are being harnessed into making money. Also on the downside, the children are being subjected to stress beyond their years and maturity levels and also, in some cases, to abuse. It comes down to us to sort through the goods and evils of reality shows and come up with some very necessary decisions – should reality shows for children be encouraged or banned? Should we come up with stricter measures to ensure the well being of the child participants? ", "gender": "F"}, {"text": "There is a general belief that religion and spirituality are outside the scope of examination using scientific methods. I beg to disagree. Science comprises observation, theory and verification. All human experience is based on observation. In ordinary life, the result of observations, over a long period of time, is called experience. However science requires the observations to be objective, systematic, accurate making conscious effort to reduce errors by repeating the experiments and having it reviewed by peers. Similarly the difference scientific theory and others is that it constructs a theoretical model based on logic and mathematics. This model has to be consistent with the observed facts. The last stage is verification during which a prediction is made and a new experiment is done to verify whether this is correct. For instance theory of relativity predicted that light rays would bend when they pass very near the Sun. This was verified and found to be correct.", "gender": "M"}, {"text": "OM Shanti Shanti Shanti   You must have gone through some unpleasant, uncomfortable moments in life when you are not FEELING GOOD about things, about situation or about people. Whether its just about salt in food or somebody around you whom you don't want in the moment or you stuck in thick traffic or somebody behaving in a way which is disturbing you or sometime for no reason we don't feel good. The most often what we do we blame others and complain about things or people about the way we feel. And this happen to most of us and most of time without being even aware about it. So what is the way out?   Here is what you can observe. Whenever you are going through some unpleasant feeling. Just give a pause to yourself and obsever what is happening inside? How is the state of your mind? Is it cluttered, agitated, heated up or heavy. In principle this is what is reflecting out (if you not ready to accept this truth say it most of the time ). So when you become aware of this disturbed state mind, just remind your mind to be peaceful and calm right now. If its too difficult give a bigger pause and just tell yourself that you are commited to inner peace, you are peace :) and first become peaceful inside. You will see immediately things will be more clearer.\n\nThis I observe after reading Guruji's one knowledge sheet where He says, \"Forget about knowledge, God, service any good thing in life, first comes the PEACE. If there is no peace nothing can happen.\" And to my experience this is so true and striking peace at first place make a tremendous difference. Its so amazing.\n\nSo next time you feel any unpleasant moods or moments: give yourself a pause and remind yourself about inner peace and chant inside Om Shanti Shanti Shanti! (Om Peace Peace Peace)\n\nAnd Share your experiences.\nAll Glory to Gurudev", "gender": "M"}, {"text": "the place is Residency...that is where this picture is shot. in 1857, when India fought against the British, the Indian Army attacked the Residency in Lucknow, where the British forces luxuriously resided. this particular grave is of a man called M. V. Nazareth who died on 5th August,1890 and was one of the defenders of residency during the seige of 1857.he was 75 years 8 months and 26 days, when he died...he was survived by his daughter who mourned him deeply. He lost his wife, Eliza Carina in the seige of 1857, who was 36 years 2 months and 8 days when she died.  Moving on to read the epitaph of Late Mr. M. V. Nazareth...\n\"ONE JUST SHALL REJOICE IN THE LORD, AND SHALL HOPE IN HIM,\nAND ALL THE UPRIGHT IN THE HEART SHALL BE PRAISED.\"\n\nNow reading the epitaph of Mrs. Eliza Carina...\n\"THOU HAST PROTECTED ME FROM THE ASSEMBLY OF THE MALIGNANT,\nFROM THE MULTITUDE OF WORKERS OF INEQUITY.\"\n\nThere are profound thoughts that this post can leave to you...i do not know if the ones that come to me are justified or not. Do bother to leave your thoughts here and share them with me.", "gender": "F"}, {"text": " Greetings and Huzzah, pitiful earth dwellers!\n\nBehold the beauty and awe put forth by this, my greatest triumph to date! This is the blog of the evil Grand Master Flash of the underworld! The one and only mechanical deity, TOBY, Robot Satan! Fall to your knees and promise your ever-loving soul to me!\n\nHave you had ample time units to reach the human kneeling position?\n\nExcellent! Fear my wrath, for from my forth floor walk-up one-bedroom perch in the doomed city of New York, I see and know all human wants, needs and eateries! Do not attempt to ignore my presence or resist my power of soul persuasion! You will surely lose, with your punishment for such insolence being the loss of all things smooth and cold!\n\nYou have now been oppressed! Through a blog!\n\nStop back often for evil updates and mighty pie recipes!\n\nYours in uncomfortably humid hellfire,\n\nMighty TOBY, Robot Satan", "gender": "M"}, {"text": "Now at this point we need to clarify the fact that three bowls containing the porridge were all made of difference materials, each with different thermal properties. This explains why when tasting Daddy bear's big bowl ofporridge discovered it was much too hot; mummy bear's medium sized bowl was freezing cold, and baby bear's small bowl was at an acceptable temperature. One can only assume that mummy bear's taste in cold porridge is not completely bonkers. Anyway, chavpig that she was, goldilocks ate up all of baby bear's porridge. This is described as a somewhat gluttenous act, even though we are initially told that baby bear's bowl is incredibly small. He's probably still being weaned off salmon. Like any good greedyguts, Goldilocks decided that she might as well sit down, and spotting the bear's three chairs decided to try them one by one. Now, Goldilocks is obviously a right fussy bitch, and daddy bear's chair was considered to be too hard, and mummy bear's chair was too soft and lumpy, like a bean bag or something. Can you imagine taking her to DFS for a new three piece suite? She'd be a bloody nightmare.", "gender": "M"}, {"text": "But these are not very comprehensive and have to be supplemented by rules each society consider necessary. These are the rules of morality and rules of law. Whereas the internal rules need no implementing agency, the external ones need agency to implement them. Early on the group leader was the authority for this purpose. During the course of time the village elders, village panchayts, the chieftain of a county, the king, the Emperor and the Government became the implementing authorities. Any one familiar with law enforcement will know that 99% of people have to be obedient to law under internal compulsion not under external threat of detection and punishment. This is usually achieved by indoctrination from childhood onwards during the course of education or otherwise. Here comes the role of religion. Every religion is a moral code. Observance of the moral code is essential for the faithful to attain whatever may be their spiritual objective. The very high percentage of faithful among humans is, I think, based on an internal programme built into our genes. No religion will stand the test of rationality. One needs a very high ability to suspend disbelief to be faithful. My theory there is an inbuilt gene, which ensures this for the majority of people. There are many other essential roles that religion plays. It relieves our fear of death and life after death, it gives hope for the hopeless, it makes it possible for one feel bliss due to religious fervor which like other human moods (happiness, sorrow, grief, pain, anger hatred, etc.) needs an outlet. It satisfies the need for performing rituals, which seem to have a psychological impact on humans. I am not aware of any society, which does not resort to rituals. ", "gender": "M"}, {"text": "I am sure a lot of people attending training would have posted about the nature of training, some maybe even about training especially at Haldia. The very reason I started to blog from our training premises is because I wanted to get over my frustration. So I’ll stick to the positives. Food, Learning and Entertainment is definitely not going to be a part of it. Sorry guys, the less said the better. Being at Haldia,I’ve learnt to manage things myself,manage finances et all.But, I would have done that anywhere.Whats specially positive about Haldia ? Right,It is a village, but its not all that pollution-free or clean-green.Thanks to the industries.They spew fire 24×7 and contribute to more holes in the already hollow ozonosphere.Nothing positive yet ? Wait for it! The people are the asset of this village (teenage guys excluded).Innocence personified.Their life is simple and they have no reason to complain.Born and brought up in a city for 22 years, our life looks so complicated when compared to theirs.", "gender": "F"}, {"text": " Will it be used for digital video content, ie, TV ? Why would we want it to be used for TV ?\n\nThe internet has the opportunity to continue to be transformative. There are applications out there that can change the quality of our lives.  Im not talking about the ability to update your facebook, or check out what where everyone is at on 4Square and twitpic what is happening to your friends and followers. Social Media is one more amazing communication platform that is impacting our lives. But its not tranformative.\n\nThere will be transformative applications that need all the bandwidth they can get. Medical, Transportation, Defense, Gaming, Simulations and who knows what. As computers become more powerful, we need to be able to send more data to the cloud where they can crunch data and return it to us.\n\nThat is the value of an open internet. The things we cant imagine today. The applications that are just dreams because  they dont have enough horsepower and bandwidth to work today. I want the internet to be a platform for amazing. Not Gilligan’s Island reruns.\n\nI recognize that with openness comes the risk of the least common denominator dominating.  Porn has just as much right to dominate the net as any other app. But should it ?\n\nYes it should. The lesson of TV over the internet vs TV over digital cable or satellite isnt about openness. Its about the value of Application Specific Networks. DIgital CAble is an application specific network. Its only job is to serve up content and it works very well.\n\nThe FCC needs to recognize this and start working with internet broadband providers to define tunnels,  Private Virtual Networks  or just plain reserved bandwidth that are saved for future applications. When a transformative application presents itself, there should be an opportunity to define the network to optimize that application.", "gender": "M"}, {"text": "Forgiven not Forgotten 1\nThe meeting of the Indian Council of Textile Owners had just dispersed. The lounge of the hotel ‘Grandeur’ was filled with rich businessmen, old and young alike; the young entrepreneurs were being introduced to the elder members by the Chairman, Mr. Ashok Sahai.\nAt the centre of the lounge stood Mr.Ryan, Ryan Jindal, surrounded by a group, consisting of the richest members of the council. He needed no introduction. The Jindal Textile Corporation had been the most powerful and successful industry in India for the past 15 years and had only doubled in its value ever since Mr.Ryan inherited it after his father five years back. Ryan had been an MBA fresher when he took up the responsibility; everybody knew there was something else in the man that made him what he was- the king of the Jindal empire. He had the strong and slender build of an athlete and was dressed in a black suit tailored to perfection. His body looked chiselled, with not a single vestigial muscle. His face was angular with a sharp, pointed nose.he had black curls that fell over his broad forehead. And his eyes… people who conversed with him rarely looked at his eyes, they made one uncomfortable. They played a huge contrast to the sophistication and aristocracy his clothes displayed. On the surface, they were insolent and impersonal, but anyone with a little more insight could see that they were only a screen to something more savage and terrifying, like the fores of nature bottled up in human form. \nAt present, he was completely bored of the flattery he was being entitled to by a group of businessmen around him. They were saying something about him being the responsible son and the future badshah of the textile world. He smiled and nodded appropriately to all the comments, but his eyes were shifting, scrutinising the groups of people around the room. Suddenly they fixed onto someone, someone standing with Mr. Ashok, being introduced to some others. His eyes never lost sight of her for a moment. He stared at her as she stood there- tall, slender- a picture of elegance. Her face wore a smile- a smile that reflected beauty and self- confidence, but more than everything, they deepened her eyes and the colour on her cheeks. A simple sari of blue silk adorned her, but she looked like she would hardly have looked less elegant in a pair of jeans or trousers.\nFor a few moments, Ryan looked at her and then turned back to the conversation immediately around.\nAfter a quarter of an hour, he heard Mr.Ashok’s voice, “Mr.Ryan, may I introduce to you Miss.Tamanna, and Ms...”. “Mr.Ryan, Ryan Jindal, I know him quite well, Mr.Ashok.” “That’s my pleasure, Ms.Tamanna.” Ryan stretched out his hand, his eyes looking straight at her as if he were challenging her. She met his eyes with defiance and took his hands coolly. Even as their fingers touched, his palm enclosed hers. The warmth from him seemed to spread all through her. Her eyes wavered just an instant and she was the first one to withdraw her hands. \nFor a moment there was troubled silence, and then Tamanna composed herself and managed a weak smile, “Nice to meet you Mr.Ryan”.\n“Of course, Ms.Tamanna, looking forward to see more of you.”\nIn sometime, Ryan took leave. He never stayed back for the Council dinners. As he walked back towards his car, he thought of her again. There was something about her, in her poise, but she had wavered from that at his touch. The thought made him happy, though no girl had ever resisted his touch. But he knew this had been different. She had been genuinely surprised, perhaps troubled, at her own response. He would find out more soon.\nThinking so, he directed his remote at his car. Something was wrong, it refused to open. He pressed again, no response. “Is anything the matter, Mr.Ryan? That’s my car.” Tamanna stood loking at him, hands folded, a smug smile on her face. Now it was his turn to be genuinely surprised. “This is your car?” He had every reason to be surprised. The car was the first of its kind in India and he had been the first Indian to get it. He loved cars, especially, huge, black ones. He would never have imagined anyone elseat the Council to have ever owned one like that. She broke into his reverie, “If you’ll please excuse me,” and she pressed the button on her remote. The car dutifully opened its door for the rightful owner. As she walked past him to get into the car, he involuntarily shifted aside, and saw his car parked some 100m away. “Good night, Mr. Ryan”, she said and just sped off.\nFor one moment he stood dumbfound and then a smile crossed his lips, a cold, cruel smile. He had discovered what was different about her. After a long time, he had been challenged. He felt a gush of adrenaline. She was an independent will, a tigress. He would possess her, he decided, “Very soon…”, were the only words that came out of his mouth.", "gender": "F"}, {"text": "The convention overall went really well. Every year it just seems to get bigger. I've been to a lot of gaming conventions in the Houston area and Owlcon remains the one to go to. A lot of those conventions come and go, but Owlcon has always remained rock steady. I can't wait until next year. This year was a bit special to top it off. Since I won the logo contest, I got to see my design on hundreds of gamers!! I can't really say I was wild about the purple but hey, it was my design on hundreds of gamers!! It was a very cool feeling. To make it all the more better, GURPS game I ran went really well and I even got to catch up with an old Army buddy I used to work and game with. Back when I still wore Army greens to work instead of pajamas, Matt and I used to hobble along company PT runs together at Fort Campbell. We went to AIT together and somehow managed to get the same duty station together for our first (and last) assignment. Both of us not being strong runners on our PT tests, we ended up doing mandatory PT.", "gender": "M"}, {"text": "Music - The fact that we have something called music to appreciate is utterly amazing…I consider it one of the ingenious things we discovered(mind you..not invented).The right music just lightens up your day! It still amazes me as to how we react emotionally to different frequency of sounds…how do we do that ? hmmm..I am no scientist so won’t delve any deeper :)  I know that the genre of music is a touchy subject for some…for example: i am not a fan (at all) of heavy metal…I detest it..but doesn’t mean i wont allow anyone else to decide for themselves.  Personally i have no particular genre to call ‘my kind of music’,it all depends on my mood…when i am up for it..I enjoy mostly romantic and soulful music..but i also enjoy R&B,Bollywood and Pop a lot too..Of late..soft rock and punk rock have caught my eye(Green day :) )  Anyway that’s a lot about me…just one question…how many of you out there listen to a particular song a million times till you are fed up? (that is my exact story..yeah i am quite boring! :p)  Coming to favorites I have way too many…so many that they can’t even be called favorites anymore.. :) Music can REALLY heal..it’s just a matter of listening to the right songs  so go pick up your i-pod,phone,laptop(or any other instrument that plays music) and get happy!", "gender": "F"}]